mocks/requestRetrieveCustomerBookings.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:my="http://company.com/myloyal">
   <soapenv:Header/>
   <soapenv:Body>
      <my:retrieveCustomerBookings>
         <my:cin>1</my:cin>
      </my:retrieveCustomerBookings>
   </soapenv:Body>
</soapenv:Envelope>